lib/tasks/import_data.rake

INSERT INTO "vic_lgas" ("gid", "pfi", "lga_code", "lga_name", "gaz_lga", "gazregn", "abslgacode", "pfi_cr", "ufi", "ufi_cr", "ufi_old", "created_at", "updated_at", "geom") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
      @vic_lga.ufi_cr = row[9] #ufi_cr,
      @vic_lga.ufi_old = row[10] #ufi_old
      @vic_lga.geom = row[11] #geom
      @vic_lga.save

SELECT "vic_lgas".* FROM "vic_lgas"
---
  task(:update_geom => :environment) do
    CSV.foreach("#{ Rails.root }/db/files/data.csv", :col_sep => ",", :headers => true) do |row|
      @vic_lgas = VicLga.all
      @vic_lgas.each do|vl|