lib/tasks/import_properties.rake


    @properties.each do |property|
      # binding.pry
      Property.create!(property.to_h)
      puts "#{Property.last.full_address}"
---
INSERT INTO "properties" ("property_id", "council_property_number", "full_address", "latitude", "longitude", "postcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "properties".* FROM "properties" ORDER BY "properties"."id" DESC LIMIT $1  [["LIMIT", 1]]