app/controllers/api/v1/vic_lgas_controller.rb

SELECT "vic_lgas".* FROM "vic_lgas" ORDER BY gid desc LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT "properties".* FROM "properties" LIMIT $1  [["LIMIT", 10]]
---
  def index

    @vic_lgas = VicLga.limit(10)
    @properties = Property.limit(10)

SELECT "vic_lgas".* FROM "vic_lgas" WHERE "vic_lgas"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]
---
  def show
    @vic_lga = VicLga.find_by_id(params[:id])